tutorials/fluids/immersedBoundary/immersedHronTurekFsi2/system/fluid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Channel of 2.5 x 0.41 m with the cylinder at (0.2 0.2) and the flag from
// x = 0.25 to 0.6 m: the mesh is uniform in 0.1 < x < 0.7 m, 0.1 < y < 0.3 m
// (5 mm cells for level 1, four cells across the 20 mm flag), and coarsens
// towards the outlet
MESH_LEVEL ${MESH_LEVEL:-1};
nRefine #eval "pow(2, $MESH_LEVEL - 1)";
nxInlet #eval "round(20*$nRefine)";
nxBand #eval "round(120*$nRefine)";
nxOutlet #eval "round(120*$nRefine)";
nyBottom #eval "round(20*$nRefine)";
nyBand #eval "round(40*$nRefine)";
nyTop #eval "round(22*$nRefine)";

vertices
(
    (0   0    0) (0.1 0    0) (0.7 0    0) (2.5 0    0)
    (0   0.1  0) (0.1 0.1  0) (0.7 0.1  0) (2.5 0.1  0)
    (0   0.3  0) (0.1 0.3  0) (0.7 0.3  0) (2.5 0.3  0)
    (0   0.41 0) (0.1 0.41 0) (0.7 0.41 0) (2.5 0.41 0)
    (0   0    0.015) (0.1 0    0.015) (0.7 0    0.015) (2.5 0    0.015)
    (0   0.1  0.015) (0.1 0.1  0.015) (0.7 0.1  0.015) (2.5 0.1  0.015)
    (0   0.3  0.015) (0.1 0.3  0.015) (0.7 0.3  0.015) (2.5 0.3  0.015)
    (0   0.41 0.015) (0.1 0.41 0.015) (0.7 0.41 0.015) (2.5 0.41 0.015)
);

blocks
(
    hex (0 1 5 4 16 17 21 20) ($nxInlet $nyBottom 1) simpleGrading (1 1 1)
    hex (1 2 6 5 17 18 22 21) ($nxBand $nyBottom 1) simpleGrading (1 1 1)
    hex (2 3 7 6 18 19 23 22) ($nxOutlet $nyBottom 1) simpleGrading (5 1 1)
    hex (4 5 9 8 20 21 25 24) ($nxInlet $nyBand 1) simpleGrading (1 1 1)
    hex (5 6 10 9 21 22 26 25) ($nxBand $nyBand 1) simpleGrading (1 1 1)
    hex (6 7 11 10 22 23 27 26) ($nxOutlet $nyBand 1) simpleGrading (5 1 1)
    hex (8 9 13 12 24 25 29 28) ($nxInlet $nyTop 1) simpleGrading (1 1 1)
    hex (9 10 14 13 25 26 30 29) ($nxBand $nyTop 1) simpleGrading (1 1 1)
    hex (10 11 15 14 26 27 31 30) ($nxOutlet $nyTop 1) simpleGrading (5 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 16 20 4) (4 20 24 8) (8 24 28 12));
    }
    outlet
    {
        type patch;
        faces ((3 7 23 19) (7 11 27 23) (11 15 31 27));
    }
    bottom
    {
        type wall;
        faces ((0 1 17 16) (1 2 18 17) (2 3 19 18));
    }
    top
    {
        type wall;
        faces ((12 28 29 13) (13 29 30 14) (14 30 31 15));
    }
    frontAndBackPlanes
    {
        type empty;
        faces
        (
            (0 4 5 1) (1 5 6 2) (2 6 7 3)
            (4 8 9 5) (5 9 10 6) (6 10 11 7)
            (8 12 13 9) (9 13 14 10) (10 14 15 11)
            (16 17 21 20) (17 18 22 21) (18 19 23 22)
            (20 21 25 24) (21 22 26 25) (22 23 27 26)
            (24 25 29 28) (25 26 30 29) (26 27 31 30)
        );
    }
);

// ************************************************************************* //
