tutorials/fluids/immersedBoundary/immersedHronTurekFsi2/constant/fsiProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fsiProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//fluidSolidInterface    fixedRelaxation;
//fluidSolidInterface    Aitken;
fluidSolidInterface    IQNILS;

"fixedRelaxationCoeffs|AitkenCoeffs|IQNILSCoeffs"
{
    // Solid interface patch
    solidPatch           plate;

    // The interface is immersed: the solid patch drives an immersed body of
    // the fluid (immersedBoundaryForce in constant/fluid/fvOptions) rather
    // than a fluid patch
    fluidPatch           none;

    immersedInterfaces
    {
        plate
        {
            // Body of the immersedBoundaryForce option, with the fsiDriven
            // motion
            body            flag;

            // Other solid patches that close the surface of the body: the
            // root of the flag, clamped to the cylinder. The patches of the
            // empty direction are not needed
            closurePatches  (plateFix);
        }
    }

    // Under-relaxation factor for passing the solid interface
    // displacement to the fluid interface
    // For fixedRelaxation, this value is used for all iterations
    // For Aitken, this value is used for the first iteration each time-step,
    // then it adaptively changes
    // For IQNILS, this value is used for the first two iterations each
    // time-step, then the IQNILS procedure is used
    relaxationFactor     0.05;

    // Tolerance for the FSI loop within each time-step. The immersed
    // interface residual stalls at about 2e-6 once the solid solution stops
    // changing within its own tolerance, so a tolerance of 1e-6 is not
    // always reached
    outerCorrTolerance   1e-5;

    // Maximum number of outer FSI loop correctors within each time-step
    nOuterCorr           30;

    // Enable/disable coupling from the start
    coupled              no;

    // Optional: if coupled is set to "no", then the couplingStartTime also you
    // to enable coupling at specified time
    couplingStartTime    2.0;

    // Write fsi residuals to file
    writeResidualsToFile yes;
}

// ************************************************************************* //
