tutorials/fluids/immersedBoundary/immersedHronTurekFsi2/Allrun
#!/bin/bash
cd "${0%/*}" || exit  # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Source solids4Foam scripts
source solids4FoamScripts.sh

# The immersed boundary library is only built with OpenFOAM.com
solids4Foam::caseDoesNotRunWithFoamExtend
solids4Foam::caseDoesNotRunWithOpenFOAMOrg

# Create the meshes; the fluid mesh density is set by MESH_LEVEL (default 1)
solids4Foam::runApplication -s solid blockMesh -region solid
solids4Foam::runApplication -s fluid blockMesh -region fluid

# Run the solver
if [[ "$1" == "parallel" ]]; then
    solids4Foam::runApplication -s fluid decomposePar -region fluid
    solids4Foam::runApplication -s solid decomposePar -region solid
    solids4Foam::runParallel solids4Foam
    solids4Foam::runApplication -s fluid reconstructPar -region fluid
    solids4Foam::runApplication -s solid reconstructPar -region solid
else
    solids4Foam::runApplication solids4Foam
fi

# Plot the tip displacement
if command -v gnuplot &> /dev/null
then
    echo "Generating deflection.pdf using gnuplot"
    gnuplot deflection.gnuplot &> /dev/null || true
else
    echo "Please install gnuplot if you would like to generate the plots"
fi
